---
title: HermiteSurface
classe: Autodesk.Revit.DB.HermiteSurface
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Surface
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# HermiteSurface

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `HermiteSurface Create(Int32, Int32, IList<XYZ>, Boolean, Boolean)` | `HermiteSurface.Create(nU, nV, points, periodicU, periodicV)` | HermiteSurface |
| `HermiteSurface Create(Int32, Int32, IList<XYZ>)` | `HermiteSurface.Create(nU, nV, points)` | HermiteSurface |
| `Boolean IsValid()` | `hermiteSurface.IsValid()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```